Repository: Slipfaith/tmragger
Catalog: sample-tmx/HW_Marketing_en-US_pt-PT_repaired.tmx
Source language: en_us
Languages: pt_pt

source: Experience thrilling battles, master powerful skills, and lead your team to ultimate victory!
pt_pt: Vive batalhas emocionantes, domina habilidades poderosas e leva a tua equipa à vitória final!

source: Thanksgiving Gifts
pt_pt: Presentes de Ação de Graças

source: It's the end of autumn!
pt_pt: O outono chegou ao fim!

source: Time to harvest trophies!
pt_pt: É hora de colher troféus!

source: Earn coins in quests and upgrade Aidan and other Heroes of the Way of Chaos!
pt_pt: Obtém moedas em missões e melhora Aidan e outros Heróis do Caminho do Caos!

source: Rewards await those who face challenges!
pt_pt: Enfrenta desafios e ganha recompensas!

source: Take part in festive events, make Heroes stronger and earn trophies!
pt_pt: Participa em eventos festivos, torna os Heróis mais fortes e ganha troféus!

source: Put the turkey into oven and jump into the game!
pt_pt: Põe o peru no forno e salta para o jogo!

source: Complete the calendar event quests and earn coins to upgrade Heroes of the Way of Chaos.
pt_pt: Conclui as missões do evento de calendário e ganha moedas para melhorar os Heróis do Caminho do Caos.

source: Get chests, trophies, festive event coins and unique loot boxes.
pt_pt: Obtém baús, troféus, moedas do evento festivo e caixas de saque únicas.

source: And make sure to check the shop: we have everything you need to upgrade the star rating of Aidan and other Heroes!
pt_pt: E verifica a loja: temos tudo aquilo de que precisas para melhorar a classificação de estrelas de Aidan e de outros Heróis!

source: May this holiday's abundance bring you new strength and new allies!
pt_pt: Que a abundância desta festa te traga nova força e novos aliados!

source: SUMMON NINJA TURTLES!
pt_pt: INVOCA AS TARTARUGAS NINJA!

source: EXPLORE NEW LOCATIONS!
pt_pt: EXPLORA NOVAS LOCALIZAÇÕES!

source: UPGRADE NEW HERO!
pt_pt: MELHORA O NOVO HERÓI!

source: SAVE THEM!
pt_pt: SALVA-OS!

source: Grow the tallest Guild Tree!
pt_pt: Cultiva a Árvore da Guilda mais alta!

source: Take part in the guild contest to grow the tallest Magic Tree!
pt_pt: Participa no concurso de guildas para cultivar a Árvore Mágica mais alta!

source: Get rewards for each milestone and take the lead!
pt_pt: Obtém recompensas por cada etapa e vence!

source: Check the new winter deals with up to 65 off and grow the tallest Magic Tree!
pt_pt: Vê promoções de inverno, até 65 de desconto, cultiva a Árvore Mágica mais alta!

source: Get warmed up with new winter deals in Dominion!
pt_pt: Aquece com as novas promoções de inverno no Domínio!

source: Don’t miss the chance to buy shop items and chests with up to 65 off and get 4 times as many emeralds for your purchase!
pt_pt: Não percas a oportunidade de comprar itens da loja e baús com até 65 de desconto e obtém 4 vezes mais esmeraldas pela tua compra!

source: Also you can stock up on valuable resources by growing the tallest Guild Tree!
pt_pt: Também podes acumular recursos valiosos ao cultivar a Árvore da Guilda mais alta!

source: Work together, get rewards for each milestone and get ahead of your rivals!
pt_pt: Trabalha em equipa, obtém recompensas por cada etapa e fica à frente dos teus rivais!

source: Pre-New Year’s Update!
pt_pt: Atualização pré-Ano Novo!

source: Magic Tree Holidays are right around the corner, but where do we put the decorations?
pt_pt: Árvore Mágica As Festas estão a chegar, mas e as decorações?

source: Help your guildmates grow the most magnificent Festive Tree in Dominion!
pt_pt: Ajuda os teus colegas a criar a mais magnífica Árvore Festiva em Domínio!

source: Take part in the event to receive valuable prizes and a unique skin for one of your Heroes!
pt_pt: Participa no evento e recebe valiosos prémios e um visual único para um dos Heróis!

source: Winter Adventure Don’t let dark forces ruin holidays for the residents of Dominion!
pt_pt: Aventura de Inverno Não deixes que as forças da escuridão estraguem a festa para os residentes em Domínio!

source: Go on a thrilling adventure with Chabba and Fox full of danger, winter miracles, and amazing gifts!
pt_pt: Parte numa excitante aventura com Chabba e Fox, cheia de perigos, milagres de inverno e prendas incríveis!

source: Create a festive atmosphere!
pt_pt: Cria uma atmosfera festiva!

source: СHOOSE TEAMMATES!
pt_pt: ESCOLHE ALIADOS!

source: Winter Skins
pt_pt: Visuais de inverno

source: Dress Folio and Isaac in fabulous outfits!
pt_pt: Veste Folio e Isaac com fatos fabulosos!

source: Don’t miss the 3-day event with outfits for Isaac and Folio, and upgrade Folio’s skin in the shop!
pt_pt: Não percas o evento de 3 dias com fatos para Isaac e Folio, e melhora o visual de Folio na loja!

source: Don’t miss out on a 65% discount on fabulous new outfits for Isaac and Folio!
pt_pt: Não percas o desconto de 65% em novos e fabulosos fatos para Isaac e Folio!

source: The holidays have ended, but the surprises haven't—a 3-day winter sale is just beginning!
pt_pt: As festas acabaram, mas as surpresas não: um evento de 3 dias está mesmo a começar!

source: Get a 65% discount on sets of fabulous new outfits for Isaac and Folio.
pt_pt: Obtém um desconto de 65% em conjuntos de fabulosos novos fatos para Isaac e Folio.

source: And what’s more, you can also upgrade Folio’s skin in the event shop.
pt_pt: Além disso, também podes melhorar o visual de Folio na loja do evento.

source: Let him shine brighter than a Christmas tree!
pt_pt: Torna-o mais brilhante do que uma árvore de Natal!

source: Play every day to collect Andvari’s Soul Stones.
pt_pt: Joga todos os dias para recolheres Pedras Anímicas de Andvari.

source: Log in every day to collect Soul Stones for the ingenious creator of the Titan Artifacts and greatly increase his power!
pt_pt: Inicia sessão todos os dias para recolheres Pedras Anímicas para o engenhoso criador dos Artefactos de Titãs e aumenta o seu poder em muito!

source: Hero of the Month — Andvari
pt_pt: Herói do mês — Andvari

source: Upgrade the master of Earth throughout January!
pt_pt: Melhora o mestre da Terra ao longo de janeiro!

source: Make the ingenious creator of the Titan Artifacts even stronger!
pt_pt: Torna o criador dos Artefactos de Titãs ainda mais forte!

source: Increase the might of unrivaled Andvari throughout January!
pt_pt: Aumenta o poder do inigualável Andvari ao longo de janeiro!

source: Blessed by the element of Earth, hold your enemies with a stone-like grasp and fight evil!
pt_pt: Abençoado pelo elemento da Terra, agarra os teus inimigos com a dureza de uma pedra e combate o mal!

source: Get new lunar outfits for Lian and Qing Mao, as well as Soul Stones, sets, and chests with nice festive discounts up to 65%!
pt_pt: Obtém novos fatos lunares para Lian e Qing Mao, bem como Pedras Anímicas, conjuntos e baús com belos descontos festivos de até 65%!

source: Celestial Lights Season
pt_pt: Época das Luzes Celestiais

source: Fireworks of events and surprises!
pt_pt: Fogo-de-artifício de eventos e surpresas!

source: Expect a plethora of festive gifts!
pt_pt: Conta com uma montanha de prendas festivas!

source: Don't miss out on new events, a titan tournament and Lunar Skins!
pt_pt: Não percas novos eventos, um torneio de titãs e Visuais Lunares!

source: Celebrate with fireworks of unforgettable events in the Celestial Lights Season!
pt_pt: Celebra com fogo-de-artifício de grandes eventos na Época da Luzes Celestiais!

source: Join several days of festivities with nice surprises and exciting adventures!
pt_pt: Junta-te a vários dias de festividades com belas surpresas e aventuras emocionantes!

source: Get supplies, obtain prize dolls with Alvanor in the Way of Nature event, fight in the titan tournament, and don't miss out on an opportunity to upgrade talismans and get new Lunar Skins for heroes!
pt_pt: Obtém mantimentos, bonecas-prémio com Alvanor no evento Caminho da Natureza, luta no torneio de titãs e não percas a oportunidade de melhorar talismãs e obter novos Visuais Lunares para os heróis!

source: Magic of the East!
pt_pt: Magia do Oriente!

source: Qing Mao Reborn The brave warrior now has a new appearance and abilities, but her bond with her brother Qing Long is as strong as ever.
pt_pt: Qing Mao Renascida A brava guerreira tem agora um novo aspeto e novas habilidades, mas a sua ligação ao irmão Qing Long está mais forte do que nunca.

source: Help them defeat evil and protect Dominion!
pt_pt: Ajuda-os a derrotar o mal e a proteger Domínio!

source: Lunar Skins Dress Qing Mao, Lian, and Tempus in Lunar outfits!
pt_pt: Visuais Lunares Veste Qing Mao, Lian e Tempus com fatos lunares!

source: To make dragon's fury burn even brighter, upgrade Qing Mao's skin in the event shop!
pt_pt: Para tornares a fúria do dragão ainda mais fervente, melhora o visual de Qing Mao na loja do evento!

source: Burn your enemies to ashes!
pt_pt: Reduz os teus inimigos a cinzas!

source: New Lunar Skins
pt_pt: Novos Visuais Lunares

source: Dress Lian and Qing Mao in elegant outfits!
pt_pt: Veste Lian e Qing Mao com fatos elegantes!

source: Don't miss your chance to upgrade the skin for the brave sister of the dragon and stock up on resources!
pt_pt: Não percas a oportunidade de melhorar o visual da corajosa irmã do dragão e de abastecer os recursos!

source: New Lunar Skins and amazing discounts up to 65%!
pt_pt: Novos Visuais Lunares e descontos incríveis de até 65%!

source: The Year of the Snake begins, bringing a themed sale to Hero Wars!
pt_pt: O Ano da Serpente começa, trazendo uma promoção temática a Hero Wars!

source: During the sale, you can also further upgrade the skin for the brave sister of the dragon, so don't miss your chance!
pt_pt: Durante a promoção, também podes melhorar ainda mais o visual da corajosa irmã do dragão. Por isso, não percas a tua oportunidade!

source: Emerald Abundance
pt_pt: Abundância de Esmeraldas

source: It's high time to stock up on resources!
pt_pt: Está na hora de abastecer os recursos!

source: An incredible abundance of gems in Dominion!
pt_pt: Uma abundância de gemas incrível no Domínio!

source: Make sure to login and get more Emeralds!
pt_pt: Inicia sessão e obtém mais Esmeraldas!

source: Get four times as many Emeralds with each purchase!
pt_pt: Obtém quatro vezes mais Esmeraldas com cada compra!

source: Don't miss the chance to stock up on Emeralds with a fourfold benefit!
pt_pt: Não percas a oportunidade de te abastecer de Esmeraldas com um benefício quádruplo!

source: Shop offers get updated every day—collect as many gems as you can!
pt_pt: A ofertas da loja são atualizadas todos os dias — obtém o maior número de gemas possível!

source: Helpful updates!
pt_pt: Atualizações úteis!

source: Easily switch Talismans Now you can change your Hero's Talisman right before battle!
pt_pt: Troca de Talismãs facilmente Agora, podes trocar o Talismã do teu Herói mesmo antes da batalha!

source: Choose your best options in the attack and defense team selection window!
pt_pt: Escolhe as tuas melhores opções na janela de seleção das equipas de ataque e defesa!

source: Convenient team selection We’ve improved the Hero selection screen: now you can switch between tile view and roulette view at any time!
pt_pt: Seleção de equipas prática Melhoramos o ecrã de seleção de Herói: agora, podes alternar entre vista em mosaico e vista em roleta em qualquer altura!

source: Let nothing distract you from saving Dominion!
pt_pt: Não deixes que nada te distraia de salvares Domínio!

source: The New Hero takes the stage!
pt_pt: O Novo Herói domina o palco!

source: Ready for the show?
pt_pt: Pronto para o espetáculo?

source: The wild performer is here!
pt_pt: O grande artista vem aí!

source: Peech is a follower of Chaos gods.
pt_pt: Peech segue os Chaos gods.

source: She wields a whip with elegant cruelty and turns battles into spectacular nightmares!
pt_pt: Ela empunha um chicote com crueldade elegante e torna batalhas em pesadelos espetaculares!

source: Are you ready for the show?
pt_pt: A postos para o espetáculo?

source: The wild performer Peech is here!
pt_pt: A grande artista Peech vem aí!

source: Being a fanatical follower of Chaos gods, Peech wields her whip with exquisite cruelty.
pt_pt: Sendo uma seguidora fanática dos Chaos gods, Peech empunha o seu chicote com uma crueldade requintada.

source: She weakens enemies with no effort, buffs allies masterfully, and turns battles into spectacular nightmares.
pt_pt: Enfraquece os inimigos sem esforço, ajuda aliados de forma magistral e transforma batalhas em pesadelos espetaculares.

source: But what is hidden behind the mask of a charismatic performer?
pt_pt: Mas o que se esconde por trás da máscara de um artista carismático?

source: Find out in the new adventure full of exciting battles and unforgettable challenges!
pt_pt: Descobre na nova aventura repleta de emocionantes batalhas e desafios inesquecíveis!

source: The show is about to begin!
pt_pt: O espetáculo está prestes a começar!

source: Hero of the Month — Marcus
pt_pt: Herói do mês — Marcus

source: Upgrade the great healer all February!
pt_pt: Melhora o grande curandeiro ao longo de fevereiro!

source: Log in every day and get Soul Stones for Marcus!
pt_pt: Inicia sessão e ganha Pedras Anímicas para Marcus!

source: Unleash a righteous punishment of unprecedented power on your enemies!
pt_pt: Liberta um justo castigo de poder nunca visto sobre os teus inimigos!

source: Log in every day in February and get Soul Stones for the great healer!
pt_pt: Inicia sessão em fevereiro e ganha Pedras Anímicas para o grande curandeiro!

source: Marcus was just a regular orphan, but when the demons attacked the monastery, he was bestowed with divine strength!
pt_pt: Marcus não passava de um órfão normal, mas quando os demónios atacaram o mosteiro, foi-lhe concedida força divina!

source: Since then, he’s fiercely defended his allies in battle, protecting them from crushing blows and healing even the most terrible wounds.
pt_pt: Desde então, defendeu ferozmente os seus aliados em batalha, protegendo-os de golpes esmagadores e curando mesmo as feridas mais terríveis.

source: Log in every day throughout February, collect Soul Stones for Marcus, and help him unlock his full potential!
pt_pt: Inicia sessão todos os dias ao longo de fevereiro, recolhe Pedras Anímicas para Marcus e ajuda-o a desbloquear todo o seu potencial!

source: Marcus in the Spotlight!
pt_pt: Marcus no Centro das Atenções!

source: Boost his skills all February!
pt_pt: Reforça as suas habilidades ao longo de fevereiro!

source: Log in daily to collect Marcus’s Soul Stones!
pt_pt: Inicia sessão e recolhe Pedras Anímicas de Marcus!

source: New romantic skins have arrived in the Dominion!
pt_pt: Novos visuais românticos chegaram ao Domínio!

source: Don’t miss your chance to deck out Corvus and Morrigan in romantic outfits and upgrade Morrigan’s skin!
pt_pt: Não percas a oportunidade de embelezar Corvus e Morrigan com trajes românticos e de atualizar o visual de Morrigan!

source: New romantic skins for Morrigan and Corvus have arrived in the Dominion!
pt_pt: Novos visuais românticos para Morrigan e Corvus chegaram ao Domínio!

source: Love is in the air...
pt_pt: O amor está no ar...

source: To celebrate the holiday, we've got a themed, three-day sale for you.
pt_pt: Temos uma promoção temática de três dias para celebrar o evento festivo.

source: New romantic outfits for Corvus and Morrigan will help them steal any hearts!
pt_pt: Os novos trajes românticos para Corvus e Morrigan vão ajudar a roubar o coração de todos!

source: Morrigan's skin can also be upgraded to make her magic reflection twice as strong.
pt_pt: O visual de Morrigan também pode ser atualizado para que o seu reflexo mágico seja duas vezes mais forte.

source: Don’t miss out on this great offer!
pt_pt: Não percas esta oferta excelente!

source: Spectacular update!
pt_pt: Atualização espetacular!

source: New heroine Under the sinister lights of the Dominion’s stage, a new star appears: the incomparable Peech!
pt_pt: Nova heroína Sob as luzes sinistras do palco de Domínio, surge uma nova estrela: a incomparável Peech!

source: With a simple crack of her whip, she brings chaos to the battle, causing enemies to tremble before her.
pt_pt: Com um estalar do seu chicote, traz o caos à batalha, fazendo os inimigos tremer.

source: Add Peech to your team and put on an unforgettable show!
pt_pt: Adiciona a Peech à tua equipa e dá um espetáculo inesquecível!

source: Romantic skins Don't miss out on charming outfits for Corvus, Morrigan, and Peech!
pt_pt: Visuais românticos Não percas fatos encantadores para Corvus, Morrigan e Peech!

source: Morrigan's skin can also be upgraded to make her magic reflection even more efficient and dramatic!
pt_pt: O visual de Morrigan também pode ser melhorado para tornar o seu reflexo mágico ainda mais eficiente e impressionante!

source: It’s your time to shine!
pt_pt: Chegou a tua vez de brilhar!

source: Temporal Anomaly
pt_pt: Anomalia Temporal

source: Upgrade Tempus and stock up on useful resources!
pt_pt: Melhora o Tempus e reabastece recursos úteis!

source: Complete tasks to summon Tempus, and buy Soul Stones and other resources for him.
pt_pt: Completa tarefas para evocares o Tempus e compra Pedras Anímicas e outros recursos para ele.

source: Time is limited!
pt_pt: O tempo é limitado!

source: Upgrade Tempus and stock up on useful resources at a 65% discount!
pt_pt: Melhora o Tempus e reabastece recursos úteis com um desconto de 65%!

source: Complete tasks to add Tempus to your team, and buy Soul Stones and other valuable resources for him in the event shop!
pt_pt: Completa tarefas para adicionares o Tempus à tua equipa e compra Pedras Anímicas e outros recursos valiosos para ele na loja de eventos!

source: Anomalous discounts up to 55% on chests and up to 65% on carousel items await, as well as four times as many emeralds for the same price!
pt_pt: Tens à espera descontos anómalos de até 55% em baús e 65% em itens de carrossel, assim como quatro vezes mais esmeraldas pelo mesmo preço!

source: Time is limited—don‘t waste a second!
pt_pt: O tempo é limitado, não percas um segundo!

source: Saint Patrick's Gifts
pt_pt: Presentes do Dia de São Patrício

source: The advent calendar and the Magic Tree await!
pt_pt: O calendário do advento e a Árvore Mágica esperam-te!

source: Log in every day to get gifts from Leprecats, and help your guild grow a tree!
pt_pt: Inicia sessão todos os dias para receberes presentes dos gnomolinos e ajuda a tua guilda a fazer crescer uma árvore!

source: Leprecats' advent calendar and the Magic Tree are already in the game!
pt_pt: O calendário do advento dos gnomolinos e a Árvore Mágica já estão no jogo!

source: Grab your luck by the tail!
pt_pt: Deixa a sorte sorrir para ti!

source: Log in every day to get gifts from Leprecats, and help your guild grow a themed tree.
pt_pt: Inicia sessão todos os dias para receberes presentes dos gnomolinos e ajuda a tua guilda a fazer crescer uma árvore temática.

source: The taller it is, the better the prizes!
pt_pt: Quanto mais alta, melhores os prémios!

source: Collect all Saint Patrick's treasures!
pt_pt: Coleciona todos os tesouros do Dia de São Patrício!

source: Spring Skins With new outfits, Faceless, Rufus, and Fafnir will be in full bloom!
pt_pt: Visuais de Primavera Novas roupas para fazer florescer Sem Rosto, Rufus e Fafnir!

source: Hurry to buy colorful clothes for your favorite heroes, and upgrade Rufus’s skin too!
pt_pt: Não percas tempo, compra vestuário colorido para os teus heróis favoritos e atualiza o visual do Rufus!

source: CRASH ENEMIES!
pt_pt: DESTRÓI INIMIGOS!

source: CHOOSE NOW!
pt_pt: ESCOLHE AGORA!

source: RUN AWAY!
pt_pt: FOGE!

source: JOIN DOMINION GUARDIANS!
pt_pt: SÊ GUARDIÃO DO DOMÍNIO!

source: LEVEL UP AND CUSTOMIZE!
pt_pt: SOBE DE NÍVEL E MUDA!

source: ASSEMBLE YOUR TEAM!
pt_pt: CRIA A TUA EQUIPA!

source: FIGHT ENEMY WAVES!
pt_pt: COMBATE VAGAS DE INIMIGOS!

source: A Stylish Update!
pt_pt: Atualização com estilo!

source: Celebrate Spring with vivid color!
pt_pt: Celebra a primavera com cores vivas!

source: Guardian Warriors in Battle!
pt_pt: Guerreiros Guardiões na Luta!

source: CHOOSE ONE!
pt_pt: ESCOLHE UM!

source: GEAR UP!
pt_pt: EQUIPA-TE!

source: SHOOT ENEMIES!
pt_pt: DESTRÓI INIMIGOS!

source: PICK THE LANE!
pt_pt: ESCOLHE A FAIXA!

source: Grab Saint Patrick's Gifts!
pt_pt: Presentes de São Patrício!

source: Log in daily and get rewards!
pt_pt: Inicia sessão diariamente e recebe recompensas!

source: The Magic Tree starts on March 20 — team up with your guild to grow the tallest tree and compete for prizes!
pt_pt: A Árvore Mágica começa a 20 de março. Ajuda a tua guilda a fazer crescer a árvore mais alta e compete por prémios!

source: Log in daily for gifts from Leprecats and grow the Magic Tree!
pt_pt: Inicia sessão diariamente para prendas dos gnomolinos e crescer a Árvore Mágica!

source: The Leprecats are waiting — log in every day to collect valuable rewards in the Advent Calendar!
pt_pt: Os gnomolinos esperam-te. Inicia sessão diariamente para receberes recompensas valiosas do calendário do advento!

source: The Magic Tree will start to bloom on March 20 — help your guild grow it and compete for a place in the ranking.
pt_pt: A Árvore Mágica começará a florir a 20 de março. Ajuda a tua guilda a fazê-la crescer e compete por um lugar na classificação.

source: The tallest trees bring the coolest rewards!
pt_pt: As árvores mais altas dão as melhores recompensas!

source: Events are available from Team Level 11.
pt_pt: Os eventos ficam disponíveis a partir do Nível de Equipa 11.

source: Join the adventure and claim your rewards!
pt_pt: Junta-te à aventura e recebe as tuas recompensas!

source: Try your luck and win prizes!
pt_pt: Tenta a sorte e ganha prémios!

source: Every attempt brings a unique trophy!
pt_pt: Cada tentativa traz um troféu único!

source: Use Punch Drops for a chance to win Talismans, skins, items for Rufus, and many other amazing rewards!
pt_pt: Usa Punch Drops para a chance de ganhares Talismãs, visuais, itens para o Rufus e muitas outras recompensas incríveis!

source: Try your luck and win prizes in the new event!
pt_pt: Tenta a sorte e ganha prémios no novo evento!

source: Use Punch Drops to win talismans, skins, exclusive items for Rufus, and many other fantastic rewards!
pt_pt: Usa Punch Drops para ganhares Talismãs, visuais, itens exclusivos para o Rufus e muitas outras recompensas fantásticas!

source: Plus, some trophies are only available during this event.
pt_pt: Além disso, alguns troféus só estão disponíveis durante este evento.

source: Don't miss your chance to hit the jackpot and make your favorite heroes even stronger!
pt_pt: Não percas a tua chance de ganhares o jackpot e tornares os teus heróis favoritos ainda mais fortes!

source: Polaris illuminates the Dominion!
pt_pt: Polaris ilumina o Domínio!

source: Embark on a journey with a new heroine!
pt_pt: Embarca numa viagem com uma nova heroína!

source: Uncover the mystery of Polaris—the star trapped in ice!
pt_pt: Descobre o mistério de Polaris, a estrela presa no gelo!

source: Humor, drama, and thrilling battles await you in this new adventure!
pt_pt: Humor, drama e batalhas incríveis esperam-te nesta nova aventura!

source: Set out on a journey with Polaris—the newest heroine on the Path of Progress!
pt_pt: Embarca numa viagem com Polaris, a nova heroína do Caminho do Progresso!

source: In this frosty new adventure, you'll face epic bosses, tough moral dilemmas, and a touching drama!
pt_pt: Nesta nova aventura gelada, irás enfrentar bosses épicos, dilemas morais difíceis e um drama tocante!
